КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НаправлениеКонвертации/КонтурЛогистика_НаправлениеКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НаправлениеКонвертации</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееВходящее</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииОтправкиТитулов/КонтурЛогистика_СценарииОтправкиТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СценарииОтправкиТитулов</name>
  <comment>что будет делать действие с задачей по умолчанию по конкретной настройке конвертации документа</comment>
  <enumValues>
    <name>НеПодписыватьОтправитьВФоне</name>
  </enumValues>
  <enumValues>
    <name>НеПодписыватьОтправитьВСеансе</name>
  </enumValues>
  <enumValues>
    <name>ПодписыватьОтправитьВФоне</name>
  </enumValues>
  <enumValues>
    <name>ПодписыватьОтправитьВСеансе</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЧерновик</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьВходящий</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_Сценарии/КонтурЛогистика_Сценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_Сценарии</name>
  <enumValues>
    <name>Отправка</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаСогласованногоКладовщиком_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновик_СогласованиеКладовщик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаВодителю_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаВодителю_СогласованиеКладовщик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновика_ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_Обработка_ОтправкаЧерновика</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаНеОбрабатывать</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаШаблона</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СпособыКонвертации/КонтурЛогистика_СпособыКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СпособыКонвертации</name>
  <enumValues>
    <name>БезДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВОрганизациюДиадок</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВПунктМаршрута</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВТранспортноеСредство</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВСотрудника</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВДоговор</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВПодразделениеДиадок</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВЛицензию</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВГорючеСмазочныйМатериал</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьПоТаблицеСоответствий</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьМассивСтруктур</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыВладенияТранспортнымСредством/КонтурЛогистика_ВидыВладенияТранспортнымСредством.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВидыВладенияТранспортнымСредством</name>
  <enumValues>
    <name>Собственность_1</name>
  </enumValues>
  <enumValues>
    <name>СовместнаяСобственностьСупругов_2</name>
  </enumValues>
  <enumValues>
    <name>Аренда_3</name>
  </enumValues>
  <enumValues>
    <name>Лизинг_4</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПользование_5</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ИнициаторыПереадресовки/КонтурЛогистика_ИнициаторыПереадресовки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ИнициаторыПереадресовки</name>
  <enumValues>
    <name>Грузоотправитель</name>
  </enumValues>
  <enumValues>
    <name>Грузополучатель</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_МетодыОпределенияМассы/КонтурЛогистика_МетодыОпределенияМассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_МетодыОпределенияМассы</name>
  <enumValues>
    <name>_01</name>
  </enumValues>
  <enumValues>
    <name>_02</name>
  </enumValues>
  <enumValues>
    <name>_03</name>
    <comment>расчет на основании данных геометрического обмера согласно загружаемому грузу и (или) технической документации на него и (или) данным измерительных приборов, имеющих регистрацию как средство измерения и прошедших соответствующую периодическую поверку</comment>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ФункцииЗаказаЗаявки/КонтурЛогистика_ФункцииЗаказаЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ФункцииЗаказаЗаявки</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_КонвертацияТиповыеУФ_УНФ/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область КонвертацияДокументов

// См. КонтурЛогистика_КонвертацияТиповые.ПоддерживаемыеТипыДокументовКонфигурации1С
//
Функция ПоддерживаемыеТипыДокументовКонфигурации1С(ТипДокументаЛогистика, СпецСценарий) Экспорт
	
	ТипыДокументовКонфигурации1С = Новый Массив;
	
	Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипДокументаЛогистика)
		Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЗЗ(ТипДокументаЛогистика)
		Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(ТипДокументаЛогистика) Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("РасходнаяНакладная");
		
	КонецЕсли;
	
	Возврат ТипыДокументовКонфигурации1С;
	
КонецФункции

// См. КонтурЛогистика_КонвертацияТиповые.ЗаполнитьБазовыеНастройкиКонвертации
//
Процедура ЗаполнитьБазовыеНастройкиКонвертации(Контекст) Экспорт
	
	Если (Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		Или Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1) Тогда
		
		Если Контекст.ТипДокумента1С = Неопределено Тогда
			
			// Если отбор = Неопределено, то подразумеваем, что есть какая то настройка для документа
			Контекст.ЕстьТиповаяКонвертация = Истина;
			
		ИначеЕсли Контекст.ТипДокумента1С = "РасходнаяНакладная" Тогда
			
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
			ЗаполнитьПутиРеквизитов_РасходнаяНакладная(Контекст);
			
		КонецЕсли;
		
	ИначеЕсли Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		Или Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда
		
		Если Контекст.ТипДокумента1С = Неопределено Тогда
			
			// Если отбор = Неопределено, то подразумеваем, что есть какая то настройка для документа
			Контекст.ЕстьТиповаяКонвертация = Истина;
			
		ИначеЕсли Контекст.ТипДокумента1С = "РасходнаяНакладная" Тогда
			
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
			Если Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
				Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;				
			Иначе
				Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.НеПодписыватьОтправитьВСеансе;
			КонецЕсли;
			
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьОрганизация = "Организация";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. КонтурЛогистика_КонвертацияТиповые.НайтиГлавныйДокументПоДокументуУчетнойСистемы
//
Функция НайтиГлавныйДокументПоДокументуУчетнойСистемы(ДокументОснование, КонтекстНастройкиКонвертации, Разделитель, ДокументОбъект) Экспорт
	
	ГлавныйДокумент = Неопределено;
	
	Если КонтекстНастройкиКонвертации.ТипДокумента1С = "ТранспортнаяНакладная" Тогда
		
		НомерДокумента = ДокументОснование.Номер;
		ДатаДокумента = ДокументОснование.Дата;
		Грузоотправитель = ?(ЗначениеЗаполнено(ДокументОснование.Грузоотправитель),
			ДокументОснование.Грузоотправитель, ДокументОснование.Организация);
		
	Иначе
		
		НомерДокумента = Неопределено;
		ДатаДокумента = Неопределено;
		Грузоотправитель = Неопределено;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерДокумента) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Грузоотправитель", Грузоотправитель);
		Запрос.УстановитьПараметр("НомерТрН", НомерДокумента);
		Запрос.УстановитьПараметр("ДатаТрН", ДатаДокумента);
		Запрос.УстановитьПараметр("Разделитель", Разделитель);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная КАК КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная
		|ГДЕ
		|	(КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Грузоотправитель = &Грузоотправитель
		|			ИЛИ &Грузоотправитель = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
		|			ИЛИ КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка))
		|	И КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.НомерТрН = &НомерТрН
		|	И (КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ДатаТрН = &ДатаТрН
		|			ИЛИ &ДатаТрН = ДАТАВРЕМЯ(1, 1, 1))
		|	И НЕ КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПометкаУдаления
		|	И (КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Разделитель = &Разделитель
		|			ИЛИ &Разделитель = НЕОПРЕДЕЛЕНО)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ГлавныйДокумент = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ГлавныйДокумент;
	
КонецФункции

// См. КонтурЛогистика_КонвертацияТиповые.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы
//
Процедура ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(ДокументОбъект, ДокументОснование, КонтекстНастройкиКонвертации, Переменные) Экспорт
	
	Если КонтекстНастройкиКонвертации.ТипДокументаЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
		Возврат;
	КонецЕсли;
	
	Если КонтекстНастройкиКонвертации.ТипДокумента1С <> "РасходнаяНакладная" Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.НомерТрН = ДокументОснование.Номер;
	ДокументОбъект.ДатаТрН = ДокументОснование.Дата;
	ДокументОбъект.ДатаЗак = ДокументОснование.Дата;
	ДокументОбъект.ЭтоЭкспедиция = Ложь;
	
	Грузоотправитель = ?(ЗначениеЗаполнено(ДокументОснование.Грузоотправитель),
		ДокументОснование.Грузоотправитель, ДокументОснование.Организация);
	ДокументОбъект.Грузоотправитель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		Грузоотправитель, "Грузоотправитель",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
		ДокументОснование, ДокументОбъект);
	
	ДокументОбъект.Перевозчик = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.Перевозчик, "Перевозчик",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
		ДокументОснование, ДокументОбъект);
		
	Грузополучатель = ?(ЗначениеЗаполнено(ДокументОснование.Грузополучатель),
		ДокументОснование.Грузополучатель, ДокументОснование.Контрагент);
	ДокументОбъект.Грузополучатель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		Грузополучатель, "Грузополучатель",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
		ДокументОснование, ДокументОбъект);
	
	ДокументОбъект.ТранспортноеСредство = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.Автомобиль, "ТранспортноеСредство",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВТранспортноеСредство,
		ДокументОснование, ДокументОбъект);
		
	ДокументОбъект.Прицеп = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.Прицеп, "Прицеп",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВТранспортноеСредство,
		ДокументОснование, ДокументОбъект);
	
	ДокументОбъект.МестоПогрузки = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.СтруктурнаяЕдиница, "МестоПогрузки",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
		ДокументОснование, ДокументОбъект);
	
	ДокументОбъект.МестоДоставки = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.АдресДоставки, "МестоДоставки",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
		ДокументОснование, ДокументОбъект);
	
КонецПроцедуры

// См. КонтурЛогистика_КонвертацияТиповые.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы
//
Процедура ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ДокументОбъект, КонтекстНастройкиКонвертации, Переменные) Экспорт
	
	Если КонтекстНастройкиКонвертации.ТипДокумента1С <> "РасходнаяНакладная" Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснование = ДокументОбъект.ДокументОснование;
	ТипДокументаЛогистика = КонтекстНастройкиКонвертации.ТипДокументаЛогистика;
	
	Если ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
		
		ЗаполнитьДокументТитул_ТрН_Титул1_РасходнаяНакладная(ДокументОбъект, ДокументОснование, КонтекстНастройкиКонвертации);
		
	ИначеЕсли ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда
		
		ЗаполнитьДокументТитул_ПЛ_Титул1_РасходнаяНакладная(ДокументОбъект, ДокументОснование, КонтекстНастройкиКонвертации);
		
	ИначеЕсли ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1 Тогда
		
		ЗаполнитьДокументТитул_ЗЗ_Титул1_РасходнаяНакладная(ДокументОбъект, ДокументОснование, КонтекстНастройкиКонвертации);
		
	КонецЕсли;
	
КонецПроцедуры

// См. КонтурЛогистика_КонвертацияТиповые.ВычислитьРеквизитыДокументаОснования
//
Функция ВычислитьРеквизитыДокументаОснования(ИменаРеквизитов, ДокументОбъект, КонтекстНастройкиКонвертации) Экспорт
	
	ЗначенияРеквизитов = Новый Структура;
	
	ДокументОснование = ДокументОбъект.ДокументОснование;
	
	Если КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "РасходнаяНакладная" Тогда
		
		Если ИменаРеквизитов.Найти("Грузоотправитель") <> Неопределено Тогда
			Грузоотправитель = ?(ЗначениеЗаполнено(ДокументОснование.Грузоотправитель),
				ДокументОснование.Грузоотправитель, ДокументОснование.Организация);
			ЗначенияРеквизитов.Вставить("Грузоотправитель", Грузоотправитель);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("Перевозчик") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Перевозчик", ДокументОснование.Перевозчик);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("Грузополучатель") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Грузополучатель", ДокументОснование.Грузополучатель);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("ТранспортноеСредство") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("ТранспортноеСредство", ДокументОснование.Автомобиль);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("МестоПогрузки") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("МестоПогрузки", ДокументОснование.СтруктурнаяЕдиница);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("МестоДоставки") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("МестоДоставки", ДокументОснование.АдресДоставки);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("Водитель") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Водитель", ДокументОснование.Водитель);
		КонецЕсли;
		
	ИначеЕсли (КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			Или КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02)
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "РасходнаяНакладная" Тогда
		
		Если ИменаРеквизитов.Найти("ЛицоОформившееПЛ") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("ЛицоОформившееПЛ", ДокументОснование.Организация);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("Водитель") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Водитель", ДокументОснование.Водитель);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("ТранспортноеСредство") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("ТранспортноеСредство", ДокументОснование.Автомобиль);
		КонецЕсли;
		
		Если КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
			Если ИменаРеквизитов.Найти("МестоОтправления") <> Неопределено Тогда
				ЗначенияРеквизитов.Вставить("МестоОтправления", ДокументОснование.СтруктурнаяЕдиница);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "РасходнаяНакладная" Тогда
		
		Если ИменаРеквизитов.Найти("Перевозчик") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Перевозчик", ДокументОснование.Перевозчик);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("Грузоотправитель") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Грузоотправитель", ДокументОснование.Грузоотправитель);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("ПунктПод") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("ПунктПод", ДокументОснование.СтруктурнаяЕдиница);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

#КонецОбласти

#Область КонвертацияСправочников

// См. КонтурЛогистика_КонвертацияТиповые.ПоддерживаемыеТипыСправочниковКонфигурации1С
//
Функция ПоддерживаемыеТипыСправочниковКонфигурации1С(ТипСправочникаЛогистика) Экспорт
	
	ТипыДокументовКонфигурации1С = Новый Массив;
	
	Если ТипСправочникаЛогистика = "КонтурЛогистика_Сотрудники" Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("ФизическиеЛица");
		
	ИначеЕсли ТипСправочникаЛогистика = "КонтурЛогистика_ОрганизацииДиадок" Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("Контрагенты");
		ТипыДокументовКонфигурации1С.Добавить("Организации");
		
	ИначеЕсли ТипСправочникаЛогистика = "КонтурЛогистика_ПунктыМаршрута" Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("РасходнаяНакладная");
		ТипыДокументовКонфигурации1С.Добавить("СтруктурныеЕдиницы");
		
	ИначеЕсли ТипСправочникаЛогистика = "КонтурЛогистика_ТранспортныеСредства" Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("ТранспортныеСредства");
		
	ИначеЕсли ТипСправочникаЛогистика = "КонтурЛогистика_Договоры" Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("ДоговорыКонтрагентов");
		
	КонецЕсли;
	
	Возврат ТипыДокументовКонфигурации1С;
	
КонецФункции

// См. КонтурЛогистика_КонвертацияТиповые.ЗаполнитьБазовыеНастройкиКонвертацииСправочника
//
Процедура ЗаполнитьБазовыеНастройкиКонвертацииСправочника(КонтекстНастройкиКонвертации) Экспорт
	
	Если КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_Сотрудники"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "ФизическиеЛица") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ОрганизацииДиадок"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "Контрагенты"
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "Организации") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ПунктыМаршрута"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "РасходнаяНакладная"
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "СтруктурныеЕдиницы") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ТранспортныеСредства"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "ТранспортныеСредства") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_Договоры"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "ДоговорыКонтрагентов") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	КонецЕсли;
	
КонецПроцедуры

// См. КонтурЛогистика_КонвертацияТиповые.ВычислитьРеквизитыСправочникаЛогистикиПоУчетномуОбъекту
//
Процедура ВычислитьРеквизитыСправочникаЛогистикиПоУчетномуОбъекту(КонтекстНастройкиКонвертации, Параметры, Результат) Экспорт
	
	УчетныйОбъект = Параметры.УчетныйОбъект;
	
	// Могуть быть незаполненными!
	ДокументОснование = Параметры.ДокументОснование;  // От заполненности этого параметра зависит заполненность РеквизитаТитула!
	ДокументОбъект = Параметры.ДокументОбъект;
	Переменные = Параметры.Переменные;
	
	ОбновлятьРеквизиты = КонтекстНастройкиКонвертации.ОбновлятьРеквизитыИзУчетнойСистемы;
	
	Если КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_Сотрудники"
		И КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "ФизическиеЛица" Тогда
		
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"РольВодитель", Истина, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ДатаРождения", УчетныйОбъект.ДатаРождения, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ИНН", УчетныйОбъект.ИНН, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Наименование", УчетныйОбъект.Наименование, ОбновлятьРеквизиты);
		
		ТелефонОсновной = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьКонтактнуюИнформациюРеквизитаДокумента(
			УчетныйОбъект, "Телефон");
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ТелефонОсновной", ТелефонОсновной, ОбновлятьРеквизиты);
		
		АдресМестаЖительства = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьКонтактнуюИнформациюРеквизитаДокумента(
			УчетныйОбъект, "Проживание");
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"АдресМестаЖительства", АдресМестаЖительства, ОбновлятьРеквизиты);
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ОрганизацииДиадок" Тогда
		
		Если КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "Контрагенты"
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "Организации" Тогда
			
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"ИНН", УчетныйОбъект.ИНН, ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"КПП", УчетныйОбъект.КПП, ОбновлятьРеквизиты);
			
			ТелефонОсновной = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьКонтактнуюИнформациюРеквизитаДокумента(
				УчетныйОбъект, "Телефон");
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"ТелефонОсновной", ТелефонОсновной, ОбновлятьРеквизиты);
			
			АдресСтрока = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьКонтактнуюИнформациюРеквизитаДокумента(
				УчетныйОбъект, "ФактАдрес");
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"АдресСтрока", АдресСтрока, ОбновлятьРеквизиты);
			
		КонецЕсли;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ПунктыМаршрута" Тогда
		
		Если КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "РасходнаяНакладная" Тогда
			
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
					"АдресИнфАдрес", ДокументОснование.АдресДоставки, ОбновлятьРеквизиты);
			КонецЕсли;
			
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"АдресИнфКодСтраны", Справочники.КонтурЛогистика_СтраныМира.НайтиПоКоду("643"), ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"Прибытие", Истина, ОбновлятьРеквизиты);
			
		ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "СтруктурныеЕдиницы" Тогда
			
			АдресИнфАдрес = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьКонтактнуюИнформациюРеквизитаДокумента(
				УчетныйОбъект, "ФактАдрес");
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"АдресИнфАдрес", АдресИнфАдрес, ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"АдресИнфКодСтраны", Справочники.КонтурЛогистика_СтраныМира.НайтиПоКоду("643"), ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"Отправление", Истина, ОбновлятьРеквизиты);
			
		КонецЕсли;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ТранспортныеСредства"
		И КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "ТранспортныеСредства" Тогда
				
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			
			ЭтоПрицеп = (КонтекстНастройкиКонвертации.РеквизитТитула = "Прицеп");
		
			Если ЭтоПрицеп Тогда
		
				ВместимостьКубМ = УчетныйОбъект.ВместимостьВКубическихМетрах;
				ГрузоподъемностьТонн = УчетныйОбъект.ГрузоподъемностьВТоннах;
				ТипТС = "Прицеп";
				
			Иначе
				
				Если ЗначениеЗаполнено(ДокументОснование.Прицеп) Тогда				
					ВместимостьКубМ = 0;
					ГрузоподъемностьТонн = 0;				
				Иначе
					ВместимостьКубМ = УчетныйОбъект.ВместимостьВКубическихМетрах;
					ГрузоподъемностьТонн = УчетныйОбъект.ГрузоподъемностьВТоннах;
				КонецЕсли;
				
				ТипТС = "Грузовой";
				
			КонецЕсли;
		
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"ВместимостьКубМ", ВместимостьКубМ, ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"ГрузоподъемностьТонн", ГрузоподъемностьТонн, ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"ТипТС", ТипТС, ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"ЭтоПрицеп", ЭтоПрицеп, ОбновлятьРеквизиты);
		
		КонецЕсли;
		
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"МаркаТС", УчетныйОбъект.Марка, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"РегНомер", УчетныйОбъект.Код, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ВидВладения", Перечисления.КонтурЛогистика_ВидыВладенияТранспортнымСредством.Собственность_1, ОбновлятьРеквизиты);
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_Договоры"
		И КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "ДоговорыКонтрагентов" Тогда
		
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ДатаДокумента", УчетныйОбъект.Дата, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Контрагент", УчетныйОбъект.Контрагент, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"КонтрагентИНН", УчетныйОбъект.Контрагент.ИНН, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Наименование", УчетныйОбъект.Наименование, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"НомерДокумента", УчетныйОбъект.Номер, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Организация", УчетныйОбъект.Организация, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ОрганизацияИНН", УчетныйОбъект.Организация.ИНН, ОбновлятьРеквизиты);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Заполняет габариты и массу записи базового соответствия номенклатуры
//
// Параметры:
//  Запись - РегистрСведенийМенеджерЗаписи.КонтурЛогистика_БазовыеСоответствияНоменклатуры
//
Процедура ЗаполнитьВесогабаритныеПараметрыБазовогоСоответствия(Запись) Экспорт

	// Заглушка
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПутиРеквизитов_РасходнаяНакладная(Контекст)
	
	ИмяТаблицы = "РасходнаяНакладная";
	Пути = Контекст.ПутиРеквизитовУчетногоДокумента;
	
	Пути.ПутьОрганизация = "Организация";
	Пути.ПутьКонтрагент = "Контрагент";
	Пути.ПутьГрузоотправитель = КонтурЛогистика_КонвертацияТиповые.ПутьРеквизитаСЗапаснымЗначением(
		ИмяТаблицы, "Грузоотправитель", "Организация", ИмяТаблицы);
	Пути.ПутьГрузополучатель = КонтурЛогистика_КонвертацияТиповые.ПутьРеквизитаСЗапаснымЗначением(
		ИмяТаблицы, "Грузополучатель", "Контрагент", ИмяТаблицы);
	Пути.ПутьДатаТРН = "Дата";
	Пути.ПутьНомерТРН = "Номер";
	Пути.ПутьМестоДоставки = "АдресДоставки";
	Пути.ПутьМестоПогрузки = "СтруктурнаяЕдиница";
	Пути.ПутьПеревозчик = "Перевозчик";
	Пути.ПутьТранспортноеСредство = "Автомобиль";
	Пути.ПутьВодитель = "Водитель";
	
КонецПроцедуры

Процедура ЗаполнитьДокументТитул_ТрН_Титул1_РасходнаяНакладная(ДокументОбъект, ДокументОснование, КонтекстНастройкиКонвертации)
	
	ДокументОбъект.ДатаВремяУбытия = ТекущаяДатаСеанса();
	
	ПродолжительностьПогрузки = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"СредняяПродолжительностьПогрузки", ДокументОбъект.ДокументЭТРН.ПартнерГрузоотправитель);
	Если ТипЗнч(ПродолжительностьПогрузки) = Тип("Число") Тогда
		ДатаВремяПодачиПлановая = ДокументОбъект.ДатаВремяУбытия - ПродолжительностьПогрузки * 60;
	Иначе
		ДатаВремяПодачиПлановая = ДокументОбъект.ДатаВремяУбытия - 3600;
	КонецЕсли;	
	ДокументОбъект.ДатаВремяПодачиПлановая 	= ДатаВремяПодачиПлановая;
	ДокументОбъект.ДатаВремяПрибытия 		= ДатаВремяПодачиПлановая;
	
	ДокументОбъект.ИнициаторПереадресации = Перечисления.КонтурЛогистика_ИнициаторыПереадресовки.Грузоотправитель;
	ДокументОбъект.МетодОпределенияМассы = Перечисления.КонтурЛогистика_МетодыОпределенияМассы._03;
	
	// ТЧ ТелефоныПереадресующего
	НоваяСтрока = ДокументОбъект.ТелефоныПереадресующего.Добавить();
	НоваяСтрока.Телефон = ДокументОбъект.ДокументЭТРН.Грузоотправитель.ТелефонОсновной;
	
	МодульОбщегоПользователи = КонтурЛогистика_СтдОбщегоНазначения.ОбщийМодульЛок("Пользователи");
	Если МодульОбщегоПользователи <> Неопределено Тогда
		ДокументОбъект.ПользовательПодписант = МодульОбщегоПользователи.ТекущийПользователь();
	КонецЕсли;
	
	ДокументОбъект.Водитель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.Водитель, "Водитель",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВСотрудника,
		ДокументОснование, ДокументОбъект);
	
	// ТЧ Товары
	Для Каждого ТекДокОснование Из КонтурЛогистика_КонвертацияТиповые.ОснованияДляЗаполненияТоваровТрН(ДокументОбъект, ДокументОснование) Цикл
		
		Для Каждого ТекущаяСтрока Из ТекДокОснование.Запасы Цикл
			
			Если Не КонтурЛогистика_КонвертацияСервер.СтрокаТоваровПодходитПоРазделителю(
					ТекущаяСтрока, КонтекстНастройкиКонвертации, ДокументОбъект, ДокументОбъект.Разделитель) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			Попытка 
				НоваяСтрока.ИдентификаторСтроки = ТекущаяСтрока.ИдентификаторСтроки;
			Исключение
				НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			КонецПопытки;
			НоваяСтрока.СостояниеГруза = "Без замечаний";
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			НоваяСтрока.Характеристика = ТекущаяСтрока.Характеристика;
			НоваяСтрока.Количество = ТекущаяСтрока.Количество;
			НоваяСтрока.ОбъявленнаяЦенность = ТекущаяСтрока.Сумма;
			НоваяСтрока.Учитывать = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументТитул_ПЛ_Титул1_РасходнаяНакладная(ДокументОбъект, ДокументОснование, КонтекстНастройкиКонвертации)
	
	ДокументОбъект.СрокПЛ = ДокументОснование.Дата;
	ДокументОбъект.ДатаПЛ = ДокументОснование.Дата;
	ДокументОбъект.НомерПЛ = ДокументОснование.Номер;
	
	ДокументОбъект.ЛицоОформившееПЛ = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.Организация, "ЛицоОформившееПЛ",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
		ДокументОснование, ДокументОбъект);
	
	ДокументОбъект.Водитель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.Водитель, "Водитель",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВСотрудника,
		ДокументОснование, ДокументОбъект);
	
	ДокументОбъект.ТранспортноеСредство = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.Автомобиль, "ТранспортноеСредство",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВТранспортноеСредство,
		ДокументОснование, ДокументОбъект);
	
	Если КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
		ДокументОбъект.МестоОтправления = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.СтруктурнаяЕдиница, "МестоОтправления",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
			ДокументОснование, ДокументОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументТитул_ЗЗ_Титул1_РасходнаяНакладная(ДокументОбъект, ДокументОснование, КонтекстНастройкиКонвертации)
	
	ДокументОбъект.ДатаЗак = ДокументОснование.Дата;
	ДокументОбъект.ДатВрПод = ТекущаяДатаСеанса();
	ДокументОбъект.ТСВместим = ДокументОснование.Автомобиль.ВместимостьВКубическихМетрах;
	ДокументОбъект.ТСГрузопод = ДокументОснование.Автомобиль.ГрузоподъемностьВТоннах;
	ДокументОбъект.ТСТип = "Грузовой";
	ДокументОбъект.Функция = Перечисления.КонтурЛогистика_ФункцииЗаказаЗаявки.Заказ;
	ДокументОбъект.ПрвзПищПрод = "Отсутствуют";
	ДокументОбъект.ПредСрПрвз = "Отсутствуют";
	ДокументОбъект.КонПунктМрш = ДокументОснование.АдресДоставки;
	ДокументОбъект.НомЗак = ДокументОснование.Номер;
	
	Грузоотправитель = ?(ЗначениеЗаполнено(ДокументОснование.Грузоотправитель),
		ДокументОснование.Грузоотправитель, ДокументОснование.Организация);
	ДокументОбъект.Грузоотправитель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		Грузоотправитель, "Грузоотправитель",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
		ДокументОснование, ДокументОбъект);
	
	ДокументОбъект.Перевозчик = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.Перевозчик, "Перевозчик",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
		ДокументОснование, ДокументОбъект);
	
	ДокументОбъект.ПунктПод = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.СтруктурнаяЕдиница, "ПунктПод",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
		ДокументОснование, ДокументОбъект);
	
	// ТЧ Товары
	Для Каждого ТекДокОснование Из КонтурЛогистика_КонвертацияТиповые.ОснованияДляЗаполненияТоваровЗЗ(ДокументОбъект, ДокументОснование) Цикл
		
		Для Каждого ТекущаяСтрока Из ТекДокОснование.Запасы Цикл
			
			Если Не КонтурЛогистика_КонвертацияСервер.СтрокаТоваровПодходитПоРазделителю(
					ТекущаяСтрока, КонтекстНастройкиКонвертации, ДокументОбъект, ДокументОбъект.Разделитель) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			Попытка 
				НоваяСтрока.ИдентификаторСтроки = ТекущаяСтрока.ИдентификаторСтроки;
			Исключение
				НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			КонецПопытки;
			НоваяСтрока.ОтгрузочноеНаименование = ТекущаяСтрока.Номенклатура.Наименование;
			НоваяСтрока.СостояниеГруза = "Без замечаний";
			НоваяСтрока.Количество = ТекущаяСтрока.Количество;
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			НоваяСтрока.Характеристика = ТекущаяСтрока.Характеристика;
			НоваяСтрока.УпаковкаЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
			НоваяСтрока.МетодОпределенияМассы = Перечисления.КонтурЛогистика_МетодыОпределенияМассы._03;
			НоваяСтрока.Учитывать = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// ТЧ АдрПункт
	НоваяСтрока = ДокументОбъект.АдрПункт.Добавить();
	НоваяСтрока.Погрузка = Истина;
	НоваяСтрока.ПунктМаршрута = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.СтруктурнаяЕдиница, "ПунктМаршрута",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
		ДокументОснование, ДокументОбъект);
	
	НоваяСтрока = ДокументОбъект.АдрПункт.Добавить();
	НоваяСтрока.Выгрузка = Истина;
	НоваяСтрока.ПунктМаршрута = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
		ДокументОснование.АдресДоставки, "МестоДоставки",
		Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
		ДокументОснование, ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти
